Конфигурация/Documents/ЗаявкаПайщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаявкаПайщика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоПрочимАктивам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиАнкетИЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПайщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминальныеДержатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаДепоВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНаСчетеДепоВладельца</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытьЗакрытьДепозитарныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственностьНаПаи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Многократная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_ДатаВремяПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФондДляОбменаПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаОбмен</Name>
					<Comment>Заполняется, если в ЛКК единая заявка на обмен паев и приобретение во втором фонде</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОперацииВЕСИАФинанс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВЛице</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПолномочий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПолномочийВЛице</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Имущество</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидИмущества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имущество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ПрочееИмуществоПереданноеВОплатуПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочееИмуществоПереданноеВОплатуПаев</Name>
			<Comment>Для ведения учета в соответствии с приказом ФСФР РФ от 15.04.2008 N 08-18/пз-н "Об утверждении Положения о порядке учета имущества, переданного в оплату инвестиционных паев паевого инвестиционного фонда"</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИмущества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоПрочимАктивам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоПрочимАктивам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИмущества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Documents/ЗаявкаПайщика/Forms/ФормаПодбораИмущества/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьОстаткиЗадолженностиНаСервере(Отказ)

	Если Не ЗначениеЗаполнено(ЭтаФорма.Параметры.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран счет ДУ",,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;

	// По умолчанию проверяем текущую дату
	Если ЭтаФорма.Параметры.Период = Неопределено Тогда
	 	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Иначе
	 	Запрос.УстановитьПараметр("Дата", ЭтаФорма.Параметры.Период);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Параметры.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.Параметры.СчетДоверительногоУправления);
	
	Запрос.УстановитьПараметр("ТипДокументаДляПодбора", ЭтаФорма.Параметры.ТипДокументаДляПодбора);
	
	Если ЭтаФорма.Параметры.ТипДокументаДляПодбора = Тип("ДокументСсылка.ВключениеПрочегоИмуществаВСоставПИФ") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.Основание КАК Основание,
			|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.ВидИмущества КАК ВидИмущества,
			|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.Имущество КАК Имущество,
			|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.КоличествоОстаток КАК Количество,
			|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.СуммаОстаток КАК Сумма
			|ИЗ
			|	РегистрНакопления.ПрочееИмуществоПереданноеВОплатуПаев.Остатки(
			|			&Дата,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ПрочееИмуществоПереданноеВОплатуПаевОстатки";
		
	ИначеЕсли ЭтаФорма.Параметры.ТипДокументаДляПодбора = Тип("ДокументСсылка.ВводПрочихАктивов") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗадолженностиПоПрочимАктивамОстатки.Основание КАК Основание,
			|	ЗадолженностиПоПрочимАктивамОстатки.ВидИмущества КАК ВидИмущества,
			|	ЗадолженностиПоПрочимАктивамОстатки.Имущество КАК Имущество,
			|	ЗадолженностиПоПрочимАктивамОстатки.СуммаОстаток КАК Сумма,
			|	ЗадолженностиПоПрочимАктивамОстатки.КоличествоОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоПрочимАктивам.Остатки(
			|			&Дата,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И &УсловиеПоЗаявке) КАК ЗадолженностиПоПрочимАктивамОстатки";
		
	ИначеЕсли ЭтаФорма.Параметры.ТипДокументаДляПодбора = Тип("ДокументСсылка.СведенияОРегистрацииПраваСобственности") Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	_ИмуществоПоЗаявкам.Основание КАК Основание,
			|	_ИмуществоПоЗаявкам.ВидИмущества КАК ВидИмущества,
			|	_ИмуществоПоЗаявкам.Имущество КАК Имущество,
			|	_ИмуществоПоЗаявкам.Сумма КАК Сумма,
			|	_ИмуществоПоЗаявкам.Количество КАК Количество
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЗадолженностиПоПрочимАктивамОстатки.Основание КАК Основание,
			|		ЗадолженностиПоПрочимАктивамОстатки.ВидИмущества КАК ВидИмущества,
			|		ЗадолженностиПоПрочимАктивамОстатки.Имущество КАК Имущество,
			|		ЗадолженностиПоПрочимАктивамОстатки.СуммаОстаток КАК Сумма,
			|		ЗадолженностиПоПрочимАктивамОстатки.КоличествоОстаток КАК Количество
			|	ИЗ
			|		РегистрНакопления.ЗадолженностиПоПрочимАктивам.Остатки(
			|				&Дата,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость)
			|					И &УсловиеПоЗаявке) КАК ЗадолженностиПоПрочимАктивамОстатки
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ПрочееИмуществоПереданноеВОплатуПаевОстатки.Основание,
			|		ПрочееИмуществоПереданноеВОплатуПаевОстатки.ВидИмущества,
			|		ПрочееИмуществоПереданноеВОплатуПаевОстатки.Имущество,
			|		ПрочееИмуществоПереданноеВОплатуПаевОстатки.СуммаОстаток,
			|		ПрочееИмуществоПереданноеВОплатуПаевОстатки.КоличествоОстаток
			|	ИЗ
			|		РегистрНакопления.ПрочееИмуществоПереданноеВОплатуПаев.Остатки(
			|				&Дата,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость)
			|					И &УсловиеПоЗаявке) КАК ПрочееИмуществоПереданноеВОплатуПаевОстатки) КАК _ИмуществоПоЗаявкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости КАК СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости
			|		ПО _ИмуществоПоЗаявкам.Имущество = СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.ОбъектНедвижимости
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Проведен
			|				И СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Дата < &ДатаДата)
			|ГДЕ
			|	СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка ЕСТЬ NULL";
		
	 	Запрос.УстановитьПараметр("ДатаДата", ?(ТипЗнч(Запрос.Параметры.Дата) = Тип("МоментВремени"),Запрос.Параметры.Дата.Дата,Запрос.Параметры.Дата));
	КонецЕсли;
	
	ЗаявкаПайщика = Неопределено;
	Если ЭтаФорма.Параметры.Свойство("ЗаявкаПайщика",ЗаявкаПайщика) Тогда 	
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоЗаявке", "ЗаявкаПайщикаИмущество.Ссылка = &ЗаявкаПайщика");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоЗаявке", "Основание = &ЗаявкаПайщика");
	 	Запрос.УстановитьПараметр("ЗаявкаПайщика", ЗаявкаПайщика);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоЗаявке", "Истина");
	КонецЕсли;
	
	
	ЭтаФорма.ОстаткиИмущества.Загрузить(Запрос.Выполнить().Выгрузить());
			
КонецПроцедуры 

&НаСервере
Функция ПолучитьХранилищеВыбранныхОстатковЗадолженностиНаСервере(НомерСтроки = Неопределено)
	
	Если НомерСтроки <> Неопределено Тогда
		Строки = Новый Массив;
		Строки.Добавить(ЭтаФорма.ОстаткиИмущества[НомерСтроки]);
	Иначе
		Строки = ЭтаФорма.ОстаткиИмущества.НайтиСтроки(Новый Структура("Флажок", Истина));
	КонецЕсли;
	
	Если Строки.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат
			Новый ХранилищеЗначения(ЭтаФорма.ОстаткиИмущества.Выгрузить(Строки));
	КонецЕсли;
	
КонецФункции 

#Область СОБЫТИЯ_ФОРМЫ_И_ЭЛЕМЕНТОВ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьОстаткиЗадолженностиНаСервере(Отказ);
	
	Если ЭтаФорма.Параметры.Свойство("ТекущиеДанные") Тогда
		РаботаСФормамиКлиентСервер.УстановитьТекущуюСтрокуТаблицы(ЭтаФорма, "ОстаткиИмущества", ЭтаФорма.Параметры.ТекущиеДанные);
	КонецЕсли;
	
	Если ЭтаФорма.ОстаткиИмущества.Количество() = 0 И ЭтаФорма.Параметры.ЗакрыватьПустой Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Элементы.НастройкиОтбора.Видимость = Элементы.ФормаКомандаПоказатьСкрытьНастройкиОтбора.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВДокумент(Команда)
	
	ТекущиеОстаткиИмущества = Элементы.ОстаткиИмущества.ТекущиеДанные;
	
	Если ТекущиеОстаткиИмущества <> Неопределено Тогда // И Не ЭтоМножественныйВыбор() Тогда
		ТекущиеОстаткиИмущества.Флажок = Истина;
	КонецЕсли;
	
	Хранилище = ПолучитьХранилищеВыбранныхОстатковЗадолженностиНаСервере();
	
	Если ЗначениеЗаполнено(Хранилище) Тогда
		ЭтаФорма.Закрыть(Хранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	Для каждого СтрокаОстаткиИмущества Из ЭтаФорма.ОстаткиИмущества Цикл
		СтрокаОстаткиИмущества.Флажок = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	Для каждого СтрокаОстаткиИмущества Из ЭтаФорма.ОстаткиИмущества Цикл
		СтрокаОстаткиИмущества.Флажок = Ложь;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти
